Revit 2027 API
City.Name Property
The name of the city
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string Name { get; }
Public ReadOnly Property Name As String
	Get
public:
property String^ Name {
	String^ get ();
}
member Name : string with get
Property Value
String
Remarks
A read only string property that contains the name of the city, such as Boston.
See Also
Reference
City Class
Autodesk.Revit.DB Namespace